In [1]:
import pandas as pd

In [2]:
df_online = pd.read_csv("data/online.csv")

In [3]:
df_online.head()

   session  visitor                   dt  custno  category  event1  event2
0   419542   140970  2016-09-16 05:03:23    3840         1     NaN       1
1  3030130    14501  2017-11-13 04:58:12   70400         1     NaN       1
2  2638740   419353  2017-05-24 16:10:38   21248         1     NaN       1
3   880408    90673  2017-10-28 13:42:38   39168         1     NaN       1
4  2612179   191542  2016-05-17 06:30:32   47616         1     NaN       1

#### Shuffle Rows

In [4]:
df_online = df_online.sample(frac=1)

In [5]:
df_online.head()

,session,visitor,dt,custno,category,event1,event2
241714,3253060,413417,2017-05-05 06:13:27,8243,3,NaN,3
674869,3696130,330406,2016-12-22 08:59:52,4677,3,NaN,8
89348,562095,330917,2017-10-09 05:42:33,55702,2,NaN,4
711007,2398420,26172,2016-08-11 13:06:57,1701,3,NaN,8
61961,2736396,104253,2017-03-05 16:02:01,61336,2,NaN,2

#### Split Dataset

In [6]:
train_frac = 0.9
dev_frac = 0.05
test_frac = 1 - train_frac - dev_frac

In [7]:
trn_cutoff = int(len(df_online) * train_frac)
dev_cutoff = int(len(df_online) * (train_frac + dev_frac))

In [8]:
df_trn = df_online[:trn_cutoff]
df_dev = df_online[trn_cutoff:dev_cutoff]
df_tst = df_online[dev_cutoff:]

In [9]:
print("""
training set: %i rows
dev set: %i rows
test set: %i rows
"""%(len(df_trn), len(df_dev), len(df_tst)))

training set: 859296 rows
dev set: 47739 rows
test set: 47739 rows

#### Save as CSV

In [10]:
# df_trn.to_csv("data/df_trn.csv", index=False)
# df_dev.to_csv("data/df_dev.csv", index=False)
# df_tst.to_csv("data/df_tst.csv", index=False)

#### Save Index to MySQL

In [18]:
from sqlalchemy import create_engine

In [19]:
username = "privateuser"
password = "***********"
port = 7777

engine = create_engine('mysql+mysqldb://%s:%s@localhost:%i/Shutterfly'%(username, password, port))

In [20]:
df_trn[["event2"]].to_sql('trn_set', engine, if_exists='append')
df_dev[["event2"]].to_sql('dev_set', engine, if_exists='append')
df_tst[["event2"]].to_sql('tst_set', engine, if_exists='append')